package com.htyoudao.youdao.framework.common.exception.enums;

/**
 * 业务异常的错误码区间，解决：解决各模块错误码定义，避免重复，在此只声明不做实际使用
 *
 * 一共 10 位，分成四段
 *
 * 第一段，1 位，类型
 *      1 - 业务级别异常
 *      x - 预留
 * 第二段，3 位，系统类型
 *      001 - 用户系统
 *      002 - 商品系统
 *      003 - 订单系统
 *      004 - 支付系统
 *      005 - 优惠劵系统
 *      ... - ...
 * 第三段，3 位，模块
 *      不限制规则。
 *      一般建议，每个系统里面，可能有多个模块，可以再去做分段。以用户系统为例子：
 *          001 - OAuth2 模块
 *          002 - User 模块
 *          003 - MobileCode 模块
 * 第四段，3 位，错误码
 *       不限制规则。
 *       一般建议，每个模块自增。
 *
 * @author 0090
 */
public class ServiceErrorCodeRange {

    // 模块 infra 错误码区间 [1_001_000_000 ~ 1_002_000_000)
    // 模块 system 错误码区间 [1_002_000_000 ~ 1_003_000_000)
    // 模块 commodity 错误码区间 [1_003_000_000 ~ 1_004_000_000)
    // 模块 member 错误码区间 [1_004_000_000 ~ 1_005_000_000)
    // 模块 order 错误码区间 [1_005_000_000 ~ 1_006_000_000)
    // 模块 promotion 错误码区间 [1_006_000_000 ~ 1_007_000_000)
    // 模块 pay 错误码区间 [1_007_000_000 ~ 1_008_000_000)
    // 模块 analysis 错误码区间 [1_008_000_000 ~ 1_009_000_000)
    // 模块 version 错误码区间 [1_009_000_000 ~ 1_010_000_000)

}
